** Summary
  - A declaration is a statement that introduces a name into a scope
  - A definition is a declaration that fully specifies the entity declared
  - A definition of a variable set aside memory so can't be defined twice
  - A declaration simply tells how a that name can be used
  - A declaration is just an interface and doesn't allocate memory
  - Something can be declared as often as you like if it's done consistently
  #+begin_src C++
    int x = 7;                      // definition
    extern int x;                   // declaration
    extern int x;                   // another declaration

    double sqrt(double);            // declaration
    double sqrt(double) {/*...*/};   // definition
    double sqrt(double);            // another declaration

    int sqrt(double);               // error!! inconsistency
  #+end_src

  #+RESULTS:

  - ~extern~ keyword states that declaration of ~x~ is not a definition
  - Avoid using ~extern~
  - A declaration supplies the type
  - A definition supplies the object (the memory)
  - A header should only contain declarations that can be duplicated in several files
  - ~(a>=b)?a:b~ is ~a~ if ~a>=b~ and ~b~ otherwise
  - Try to avoid class in function
  - Function within function is not allowed
  - Pass-by-const-reference: ex) ~const vector<double>& v~
  - Pass-by-reference: ex) ~vector<double>& v~
  - Technical point of reference
  #+begin_src C++ :main no
    #include <iostream>

    int main()
    {
      int i = 7;
      int& r = i;                   // r is a reference to i
      r = 9;                        // i becomes 9
      i = 10;
      std::cout << r << ' ' << i << '\n'; // write: 10 10
    }
  #+end_src

  #+RESULTS:
  : 10 10
  - Any use of ~r~ is a use of ~i~
  - Reference can be a convenient shorthand for some object
  - ~double& var = v[f(x)][g(y)];~
  - Non-const-reference is essential in
    - manipulating containers and other large objects
    - for functions that change several objects (function can have only one return value)
  - Argumnet checking and conversion
  #+begin_src C++ :main no
    #include <iostream>

    int main()
    {
      double x = 1.2;
      int x1 = x;                   // truncate x
      int x2 = int(x);
      int x3 = static_cast<int>(x); // explicit conversion

      std::cout << "x1 = " << x1 << ", x2 = " << x2
                << " ,x3 = " << x3 << std::endl;

      return 0;
    }
  #+end_src

  #+RESULTS:
  | x1 = 1 | x2 = 1 | x3 = 1 |
  - constexpr functions: evaluated by the compiler to avoid the same calculation done millions of times at run time
  - A constexpr function with constexpr arguments is evaluated by compiler
  - Construct the ~Date~ once only
  #+begin_src C++ 
    const Date& default_date()
    {
      static const Date dd(1970,1,1);
      return dd;
    }
  #+end_src
  - The ~static~ local variable is initialized only the first time its function is called
*** Ex 3 
    #+name: ex3-08
    #+begin_src C++ :main no :results output
      #include "/home/lsg/Programming/PPP/std_lib_facilities.h"

      void print(const vector<int>& v, const string& name)
      {
        cout << v.size() << " values in " << name << endl;
        cout << '{' << v[0] <<", ";
        for (int i=1;i<v.size();++i) {
          if (i%5==0) cout << endl;
          cout << v[i];
          if (i<v.size()-1) cout << ", ";
        }
        cout << '}' << endl;
      }


      void fibonacci(const int x,const int y,vector<int>& v,const int n)
      {
        if (n<1) return;
        if (n>=1) v.push_back(x);
        if (n>=2) v.push_back(y);

        for (int i=2; i<n; ++i) {
          int k = v[i-2] + v[i-1];
          v.push_back(k);
        }
      }

      int main()
      {
        int x=1;
        int y=2;
        vector<int> v;
        int n=10;
        fibonacci(x,y,v,n);
        print(v,"fibonacci");

        return 0;
      }
    #+end_src

    #+RESULTS: ex3-08
    : 10 values in fibonacci
    : {1, 2, 3, 5, 8, 
    : 13, 21, 34, 55, 89}
    If the name of source code block is "main", there is no output of result. (I don't know why...)

*** Ex 1
    #+begin_src conf :tangle ch10/integers.txt
      10 20 30 40
    #+end_src

    #+name: ex01
    #+begin_src C++ :main no
      // sum of whitespace seperated integers in a file
      #include "/home/lsg/Programming/PPP/std_lib_facilities.h"

      int main()
      {
        const string& filename = "/home/lsg/Programming/PPP/ch10/integers.txt";

        ifstream ifs{filename};
        if(!ifs) error("can't open the file, ",filename);

        int n;
        vector<int> numbers;
        while(ifs>>n) {
          numbers.push_back(n);
        }

        for(int i : numbers)
          cout << i << ' ';
        cout << endl;

        int sum;
        for(int i : numbers)
          sum += i;
        cout << "sum is " << sum << endl;

      }
    #+end_src

    #+RESULTS: ex01
    : Lines containing a word: file
    : Line 1: This is The Input file    for the Lower case OUTPUT

*** Drill
    #+name: test_output
    #+begin_src C++ :main
      #include "/home/lsg/Programming/PPP/std_lib_facilities.h"

      void print_float(double d)
      {
        cout << "defaultfloat:\t" << d << endl
             << "fixed:\t" << fixed << d << endl
             << "scientific:\t" << scientific << d << endl;
      }
      int main()
      {
        int birth_year = 1979;

        cout << "Decimal: " << '\t' << birth_year << endl
             << "Hexadecimal: " << '\t' <<hex << birth_year << endl
             << "Octal: " << '\t' << oct << birth_year << endl;

        double d = 1234567.89;
        print_float(d);

        return 0;
      }
    #+end_src

    #+RESULTS: test_output
    | Decimal:      |         1979 |
    | Hexadecimal:  |          7bb |
    | Octal:        |         3673 |
    | defaultfloat: |  1.23457e+06 |
    | fixed:        |   1234567.89 |
    | scientific:   | 1.234568e+06 |

    #+name: d8
    #+begin_src C++ :main no :tangle ch11/drill08.cpp
      #include "../std_lib_facilities.h"

      int main()
      {
        int a,b,c,d;

        cin >> a >> oct >> b >> hex >> c >> d;
        cout << a << '\t' << b << '\t' << c << '\t' << d << endl;

        return 0;
      }
    #+end_src

   - Manipulator: Terms that are used to change the behavior of a stream
   - Fields: A mechainsm for integer to control the space a value takes up. (set field width) =setw()=

* Calculator
   #+name: grammar
   #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
     /*
     Grammar

     Calculation:
       Statement
       Print
       Quit
       Help
       Calculation Statement

     Statement:
       Declaration
       Expression

     Print:
       ";"

     Quit:
       "q"

     Declaration:
       "let" Name "=" Expression
       "const" Name "=" Expression

     Name:
       letter
       letter Sequence

     Sequence:
       letter
       digit
       "-"
       letter Sequence
       digit Sequence
       "-" Sequence

     Expression:
       Term
       Expression "+" Term
       Expression "-" Term

     Term:
       Primary
       Term "*" Primary
       Term "/" Primary
       Term "%" Primary

     Primary:
       Number
       "(" Expression ")"
       "-" Primary
       "+" Primary
       "sqrt(" Expression ")"
       "pow(" Expression "," Integer ")"
       Name
       Name "=" Expression

     Number
       floating-point-literals

     */
    #+end_src


    #+name: header
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      #include "../std_lib_facilities.h"

    #+end_src



    #+name: Constants
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      const char let = 'L';
      const char con = 'C';
      const char quit = 'q';
      const char help = 'h';
      const char print = ';';
      const char number = '8';
      const char name = 'a';
      const char square_root = 's';
      const char power = 'p';
      const string declkey = "let";
      const string constkey = "const";
      const string sqrtkey = "sqrt";
      const string powkey = "pow";
      const string quitkey = "quit";
      const string helpkey = "help";
      const string prompt = "> ";
      const string result = "= ";

      // ------------------------------------------------------------ 

    #+end_src

    

    #+name: Class definitions
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      class Token {
      public:
        char kind;
        double value;
        string name;
        Token(char ch) :kind{ch}, value{0} {}
        Token(char ch, double val) :kind{ch}, value{val} {}
        Token(char ch, string n) :kind{ch}, name{n} {}
      };

      class Token_stream {
      public:
        Token_stream();               // make Token_stream that reads from cin
        Token_stream(istream&);        // reads from istream
        Token get();
        void putback(Token t);
        void ignore(char c);          // discard characters up to and including 'c'
      private:
        bool full;
        Token buffer;
      };

      // Constructor
      Token_stream::Token_stream()
        :full{false}, buffer{0} {}

      // ------------------------------------------------------------

    #+end_src



    #+name: token_stream
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      Token Token_stream::get()
      {
        if (full) {
          full = false;
          return buffer;
        }

        char ch;
        cin.get(ch);                  // cin.get does not skip white space
        while (isspace(ch)){
          if (ch=='\n') return Token{print};
          cin.get(ch);
        }

        switch (ch){
        case print:
        case '(': case ')':
        case '+': case '-': case '*': case '/': case '%':
        case '=':
        case ',':
          return Token{ch};
        case '.':
        case '0': case '1': case '2': case '3': case '4':
        case '5': case '6': case '7': case '8': case '9':
          {
            cin.putback(ch);
            double val;
            cin >> val;
            return Token{number,val};
          }
        default:
          if (isalpha(ch)) {
            string s;
            s += ch;
            while (cin.get(ch) && (isalpha(ch)||isdigit(ch)||ch=='_')) s+=ch;
            cin.putback(ch);
            if (s==declkey) return Token{let};
            if (s==constkey) return Token{con};
            if (s==sqrtkey) return Token{square_root};
            if (s==powkey) return Token{power};
            if (s==helpkey) return Token{help};
            if (s==quitkey) return Token{quit};
            return Token{name,s};
          }
          error("Bad Token");
        }
      }

      //---------------------------------------------------------------------

      void Token_stream::putback(Token t)
      {
        if (full) error("putback() into full buffer");
        buffer = t;
        full = true;
      }

      //---------------------------------------------------------------------

      void Token_stream::ignore(char c)
      // 'c' is kind of token
      {
        // look in buffer first
        if (full && c==buffer.kind) {
          full = false;
          return;
        }
        // if c is not equal to the kind of buffer
        // empty buffer
        full = false;

        char ch = 0;
        while (cin>>ch)
          if (ch==c) return;
      }
    #+end_src

    #+RESULTS: token_stream




    Variable is type for (name,value) pairs.
    Symbol_table is a container for Variable type.

    #+name: variables
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      class Variable {
      public:
        string name;
        double value;
        bool is_const;
        Variable(string n, double v, bool c) :name{n}, value{v}, is_const{c} {}
      };

      //------------------------------------------------------------------------

      class Symbol_table {
      public:
        double get(string s);
        void set(string s, double d);
        bool is_declared(string s);
        double declare(string s, double d, bool b);
      private:
        vector<Variable> var_table;
      };

      //-------------------------------------------------------------------------

      double Symbol_table::get(string s)
      {
        for (const Variable& v : var_table)
          if (v.name==s) return v.value;
        error("get() undefined variable",s);
      }

      //-------------------------------------------------------------------------

      void Symbol_table::set(string s, double d)
      {
        for (Variable& v: var_table)
          if (v.name==s) {
            if (v.is_const) error(v.name," is a constant");
            v.value = d;
            return;
          }
        error("set() undefined variable ",s);
      }

      //---------------------------------------------------------------------------

      bool Symbol_table::is_declared(string s)
      {
        for (const Variable& v : var_table)
          if (v.name==s) return true;
        return false;
      }

      //---------------------------------------------------------------------------

      double Symbol_table::declare(string s, double d, bool b)
      {
        if (is_declared(s)) error(s, " declared already");
        var_table.push_back(Variable{s,d,b});
        return d;
      }

      //--------------------------------------------------------------------------

      Symbol_table st;
    #+end_src



    Grammar for Primary
     - Number
     - "(" Expression ")"
     - "-" Primary
     - "+" Primary
     - "sqrt(" Expression ")"
     - "pow(" Expression "," Integer ")"
     - Name
     - Name "=" Expression
 
    #+name: Primary
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
      double expression(Token_stream& ts);

      double primary(Token_stream& ts)
      {
        Token t = ts.get();
        switch (t.kind) {
        case '(':
          {
            double d = expression(ts);
            t = ts.get();
            if (t.kind!=')') error("')' expected");
            return d;
          }
        case '-':
          return -primary(ts);
        case '+':
          return primary(ts);
        case number:
          return t.value;
        case name:
          {
            Token t2 = ts.get();
            if (t2.kind=='='){
              double d = expression(ts);
              st.set(t.name,d);
              return d;
            }
            else {                    // not an assignment
              ts.putback(t2);
              return st.get(t.name);
            }
          }
        case square_root:
          {
            t = ts.get();
            if (t.kind!='(') error("'(' expected");
            double d = expression(ts);
            t = ts.get();
            if (t.kind!=')') error("')' exprected");
            return sqrt(d);
          }
        case power:
          {
            t = ts.get();
            if (t.kind!='(') error("'(' expected");
            double d = expression(ts);
            t = ts.get();
            if (t.kind!=',') error("',' expected");
            t = ts.get();
            if (t.kind!=number) error("second argumnet of pow() is not a numner");
            int i = int(t.value);
            if (i!=t.value) error("second argument of pow() is not an integer");
            t = ts.get();
            if (t.kind!=')') error("')' expected");
            return pow(d,i);
          }
        default:
          error("primary expected");
        }
      }

      //---------------------------------------------------------------------------
      
      #+end_src



      Grammar for Term
       - Primary
       - Term "*" Primary
       - Term "/" Primary
       - Term "%" Primary

    #+name: Term
    #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
            double term(Token_stream& ts)
            {
              double left = primary(ts);
              Token t = ts.get();

              while (true) {
                switch (t.kind) {
                case '*':
                  left *= primary(ts);
                  t = ts.get();
                  break;
                case '/':
                  {
                    double d = primary(ts);
                    if (d==0) error("division by 0");
                    left /= d;
                    t = ts.get();
                    break;
                  }
                case '%':
                  {
                    double d = primary(ts);
                    if (d==0) error("division by 0");
                    left = fmod(left,d);
                    t = ts.get();
                    break;
                  }
                default:
                  ts.putback(t);
                  return left;
                }
              }
            }

      //-----------------------------------------------------------------------------
     
      #+end_src



      Grammar for Expression
       - Term
       - Expression "+" Term
       - Expression "-" Term

      #+name: Expression
      #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
        double expression(Token_stream& ts)
        {
          double left = term(ts);
          Token t = ts.get();

          while (true) {
            switch (t.kind) {
            case '+':
              left += term(ts);
              t = ts.get();
              break;
            case '-':
              left -= term(ts);
              t = ts.get();
              break;
            case '=':
              error("use '=' outside of declaration");
            default:
              ts.putback(t);
              return left;
            }
          }
        }

        // ------------------------------------------------------------

    #+end_src


    Grammar for Declaration
     - "let" Name "=" Expression
     - "const" Name "=" Expression
     =double Symbol_table::declare(string s, double d, bool b)= for varible keeping in =Symbol_table st=.
     =bool b= is =true= for =const=, =false= for =let=.
 
       #+name: Declaration
       #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
         double declaration(bool b, Token_stream& ts)
         {
           Token t = ts.get();
           if (t.kind!=name) error("name expected in declaration");
           string var_name = t.name;

           Token t2 = ts.get();
           if (t2.kind!='=') error("= missing in declaration of ", var_name);

           double d = expression(ts);
           st.declare(var_name,d,b);

           return d;
         }

         // ------------------------------------------------------------
       #+end_src


    Grammar for Statement
     - Declaration
     - Expression
    
       #+name: Statement
       #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
         double statement(Token_stream& ts)
         {
           Token t = ts.get();
           switch (t.kind) {
           case let:
             return declaration(false,ts);
           case con:
             return declaration(true,ts);
           default:
             ts.putback(t);
             return expression(ts);
           }
         }

         // ------------------------------------------------------------
       #+end_src



     #+name: Help functions
     #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
       // clean input after error
       void clean_up_mess(Token_stream& ts)
       {
         ts.ignore(print);
       }

       // ------------------------------------------------------------

       void print_help()
       {
         cout << "Instructions: enter expressions, there are\n"
              << "a few functions, you can declare variables using\n"
              << " the 'let' keyword and constants with the 'const'\n"
              << "keyword."
              << endl;
       }

       // ------------------------------------------------------------
     #+end_src
    Grammar for Calculation
     - Statement
     - Print
     - Quit
     - Help
     - Calculation Statement

       #+name: Calculate
       #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
         void calculate()
         {
           Token_stream ts;
           while (cin) 
             try {
               cout << prompt;
               Token t = ts.get();
               while (t.kind==print) t = ts.get(); // first discard all "prints"
               if (t.kind==help) print_help();
               else {
                 if (t.kind==quit) return;
                 ts.putback(t);
                 cout << result << statement(ts) << endl;
               }
             }
             catch(exception& e) {
               cerr << e.what() << endl;
               clean_up_mess(ts);
             }
         }

         // ------------------------------------------------------------
       #+end_src




     #+name: main
     #+begin_src C++ :main no :tangle calculator/calculator_v3.cpp
       int main()
         try {
           st.declare("pi",3.1415926535,true);
           st.declare("e",2.7182818284,true);
           st.declare("k",1000,true);

           calculate();

           return 0;
         }
         catch (exception& e) {
           cerr << "exception: " <<e.what() << endl;
           char c;
           while (cin>>c && c!=';');
           return 1;
         }
         catch(...) {
           cerr << "exception\n";
           char c;
           while (cin>>c && c!=';');
           return 2;
         }
     #+end_src

     #+RESULTS: main
     : 10 values in fibonacci
     : {1, 2, 3, 5, 8, 
     : 13, 21, 34, 55, 89}




   

